{
  "plugins": {
    "ReplaceWithRegister": {
      "src": "https://github.com/vim-scripts/ReplaceWithRegister"
    },
    "blink.cmp": {
      "src": "https://github.com/saghen/blink.cmp"
    },
    "camelcasemotion": {
      "src": "https://github.com/bkad/camelcasemotion"
    },
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "dressing.nvim": {
      "src": "https://github.com/stevearc/dressing.nvim"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "lox": {
      "src": "https://github.com/marcuscaisey/lox"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim"
    },
    "multicursor.nvim": {
      "src": "https://github.com/jake-stewart/multicursor.nvim"
    },
    "nvim-lightbulb": {
      "src": "https://github.com/kosayoda/nvim-lightbulb"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-surround": {
      "src": "https://github.com/kylechui/nvim-surround"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'master'"
    },
    "nvim-treesitter-context": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-context",
      "version": "'master'"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects",
      "version": "'master'"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/kyazdani42/nvim-web-devicons"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim"
    },
    "olddirs.nvim": {
      "src": "https://github.com/marcuscaisey/olddirs.nvim"
    },
    "please.nvim": {
      "src": "https://github.com/marcuscaisey/please.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "telescope-fzf-native.nvim": {
      "src": "https://github.com/nvim-telescope/telescope-fzf-native.nvim"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim"
    },
    "vim-fugitive": {
      "src": "https://github.com/tpope/vim-fugitive"
    },
    "vim-indent-object": {
      "src": "https://github.com/michaeljsmith/vim-indent-object"
    },
    "vim-textobj-entire": {
      "src": "https://github.com/kana/vim-textobj-entire"
    },
    "vim-textobj-user": {
      "src": "https://github.com/kana/vim-textobj-user"
    }
  }
}