{
  "plugins": {
    "camelcasemotion": {
      "src": "https://github.com/bkad/camelcasemotion"
    },
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "fzf-lua": {
      "src": "https://github.com/ibhagwan/fzf-lua"
    },
    "gitlinker.nvim": {
      "src": "https://github.com/linrongbin16/gitlinker.nvim"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim"
    },
    "multicursor.nvim": {
      "src": "https://github.com/jake-stewart/multicursor.nvim"
    },
    "nvim-lightbulb": {
      "src": "https://github.com/kosayoda/nvim-lightbulb"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-surround": {
      "src": "https://github.com/kylechui/nvim-surround"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-treesitter-context": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-context"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/kyazdani42/nvim-web-devicons"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim"
    },
    "olddirs.nvim": {
      "src": "https://github.com/marcuscaisey/olddirs.nvim"
    },
    "please.nvim": {
      "src": "https://github.com/marcuscaisey/please.nvim"
    },
    "vim-ConflictMotions": {
      "src": "https://github.com/inkarkat/vim-ConflictMotions"
    },
    "vim-CountJump": {
      "src": "https://github.com/inkarkat/vim-CountJump"
    },
    "vim-ReplaceWithRegister": {
      "src": "https://github.com/inkarkat/vim-ReplaceWithRegister"
    },
    "vim-fugitive": {
      "src": "https://github.com/tpope/vim-fugitive"
    },
    "vim-indent-object": {
      "src": "https://github.com/michaeljsmith/vim-indent-object"
    },
    "vim-ingo-library": {
      "src": "https://github.com/inkarkat/vim-ingo-library"
    },
    "vim-textobj-entire": {
      "src": "https://github.com/kana/vim-textobj-entire"
    },
    "vim-textobj-user": {
      "src": "https://github.com/kana/vim-textobj-user"
    }
  }
}
